Config/Catalogs/ПроизвольныеБланкиФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПроизвольныеБланкиФорм</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Макет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВариантыФорм</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/InformationRegisters/ХранимыеМакетыНастроекОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ХранимыеМакетыНастроекОтчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Макет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипМакета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыХранимыхМакетовНастройки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПроверки</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроизвольныеБланкиФорм</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Catalogs/ПроизвольныеБланкиФорм/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

// Процедура - обработчик события объекта "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)
	
	//Хеш рассчитывается всегда
	РассчитатьХешПоРеквизитамОбъекта();
	
	Если ОбменДанными.Загрузка 
		ИЛИ БюджетнаяОтчетность.ЗагрузкаКомплектаОтчетности(ЭтотОбъект) 
		ИЛИ ПометкаУдаления Тогда
			
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДополнительныеСвойства.Вставить("ОбъектКопирования",ОбъектКопирования.Ссылка);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ОбъектКопирования") Тогда
		
		НаборЗаписей = РегистрыСведений.ХранимыеМакетыНастроекОтчетов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Владелец.Установить(ДополнительныеСвойства.ОбъектКопирования);
		НаборЗаписей.Прочитать();
		
		ТаблицаНабораЗаписей = НаборЗаписей.Выгрузить();
		ТаблицаНабораЗаписей.ЗаполнитьЗначения(Ссылка,"Владелец");
		НаборЗаписей.Загрузить(ТаблицаНабораЗаписей);
		НаборЗаписей.Отбор.Владелец.Установить(Ссылка);
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры


Процедура РассчитатьХешПоРеквизитамОбъекта() Экспорт
	
	Если ОбменДанными.Загрузка Тогда 
		Если ОбменДанными.Отправитель <> Неопределено Тогда
			//Если это загрузка данных из главного узла, то ничего делать не нужно.
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ХешОбновлен")
		И ЗначениеЗаполнено(ХешРеквизитов) Тогда
		Возврат;	
	КонецЕсли;
	
	ДопустимыеВР = БюджетнаяОтчетностьСервер.ПолучитьДопустимыеВидыРеквизитаДляХеша();
	
	МассивФормированияХеша = Новый Массив;
	//Порядок следования реквизитов: стандартные, по алфавиту, обычные, по алфавиту
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"Код",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"Наименование",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"ПометкаУдаления",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
	
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"Использование",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"Макет",МассивФормированияХеша,ДопустимыеВР.ХранилищеЗначения,ДопустимыеВР);
	
	Для Инд = 0 По ВариантыФорм.Количество()-1 Цикл
		
		СтрТЧ = ВариантыФорм[Инд];
		
		БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧ,"Название",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
		БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧ,"Подсказка",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
		БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧ,"Основной",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
	КонецЦикла;		
				
	СтрокаХеша = СтрСоединить(МассивФормированияХеша);
	ХешированиеД = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеД.Добавить(СтрокаХеша);
		
	ХешРеквизитов = Base64Строка(ХешированиеД.ХешСумма);
		
	ХешированиеД = Неопределено;
	МассивФормированияХеша = Неопределено;
		
КонецПроцедуры


#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
